In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.0.3'

In [4]:
import numpy as np

In [5]:
np.__version__

'1.18.1'

In [6]:
np.random.seed(42)

In [12]:
df = pd.DataFrame(np.random.randint(20, size=(8,3)), columns=list('BCA'))
df

    B   C   A
0   2   4  18
1   6   8   6
2  17   3  13
3  17   8   1
4  19  14   6
5  11   7  14
6   2  13  16
7   3  17   7

<h3> Remove column A and inset it into the beginning </h3>

In [13]:
first_col = df.pop('A')

In [14]:
first_col

0    18
1     6
2    13
3     1
4     6
5    14
6    16
7     7
Name: A, dtype: int32

In [15]:
df

    B   C
0   2   4
1   6   8
2  17   3
3  17   8
4  19  14
5  11   7
6   2  13
7   3  17

In [17]:
df.insert(0,'A',first_col)

In [18]:
df

    A   B   C
0  18   2   4
1   6   6   8
2  13  17   3
3   1  17   8
4   6  19  14
5  14  11   7
6  16   2  13
7   7   3  17